{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles and multi-chat storage with create, fetch, and restricted chatbot reply functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light and dark themes and applying global styles.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React component handling authentication, multi-chat flow, message sending, autosave, and profile setup.",
  "frontend/src/components/AuthButton.tsx": "Sign‑in/sign‑out button integrating Internet Identity with login state handling.",
  "frontend/src/components/ChatComposer.tsx": "Message composer with textarea and send button supporting Enter-to-send behavior.",
  "frontend/src/components/ChatHistoryPanel.tsx": "Sidebar listing chats with selection, creation, and deletion including a confirmation dialog.",
  "frontend/src/components/ChatMessage.tsx": "Renders a chat message with user or assistant avatar styling and displays message content with role‑based colors.",
  "frontend/src/components/DeveloperSafetyNote.tsx": "Provides a collapsible developer warning highlighting API key exposure risks and best security practices.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog for entering and saving a user name using backend mutation with error handling.",
  "frontend/src/components/SafetyUsage.tsx": "Displays chatbot safety guidelines, content restrictions, and acceptable usage information.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useChatAutosave.ts": "Handles restoring and persisting chat messages, saving to backend when authenticated or local storage when anonymous.",
  "frontend/src/hooks/useChats.ts": "Provides hooks for listing chats, fetching a chat, creating chats, deleting chats, and adding messages via the backend actor.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current authenticated user's profile with proper loading state handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and exposes the authenticated identity to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation for sending a prompt to the backend chatbot and invalidates message queries after replies.",
  "frontend/src/index.css": "Defines Tailwind base layers and a full light/dark OKLCH color theme using CSS variables, plus some global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, then renders App.",
  "frontend/src/types/chat.ts": "Declares the UIMessage interface for chat messages with id, role, content, and timestamp.",
  "frontend/src/utils/chatLocalStore.ts": "Provides localStorage helpers for saving, loading, selecting, and clearing chat conversations.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading URL parameters, storing them in sessionStorage, and managing persisted values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, OKLCH color variables, container settings, and extended animations and components.",
  "project_state.json": "Tracks project metadata, safety notes, existing features, and known issues for the build."
}