{
  "kind": "build_request",
  "title": "Make the chatbot UI mobile-accessible (responsive + touch-friendly)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Make the main layout responsive so the chat experience is fully usable on phones and tablets, including proper handling of the authenticated chat history panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it accessible for mobile too"
        ]
      },
      "acceptanceCriteria": [
        "On small screens (e.g., 320–480px wide), the app content fits without horizontal scrolling.",
        "When authenticated, the chat history sidebar does not permanently consume screen width on mobile; it is hidden behind a toggle (e.g., drawer/sheet) or collapses, and the user can still create/select/delete chats from it.",
        "Header actions (Safety & Usage, Clear Chat when present, Sign in/out) remain reachable on mobile (wrap to multiple lines or move into an overflow menu) without overlapping/clipping.",
        "The messages list and composer remain usable on mobile: messages area scrolls independently and the composer stays accessible at the bottom without being pushed off-screen."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Improve mobile ergonomics and accessibility for touch devices across the chat UI (composer, buttons, dialogs).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it accessible for mobile too"
        ]
      },
      "acceptanceCriteria": [
        "Primary interactive targets used frequently on mobile (send button, new chat, chat row tap area, sign in/out) meet a touch-friendly minimum size and spacing (at least ~44px tap target).",
        "Text input is comfortable on mobile: the textarea and send button do not overflow the viewport and remain visible when the on-screen keyboard is open.",
        "Dialogs (e.g., Safety & Usage, delete chat confirmation) render within the viewport on mobile with scrollable content when needed, and no content is cut off."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Ensure the UI uses mobile-safe sizing and spacing throughout the main containers (header/main/footer) and chat area widths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you make it accessible for mobile too"
        ]
      },
      "acceptanceCriteria": [
        "The main chat column max width and padding adapt to small screens (reduced side padding, no forced max-width that causes cramped layout).",
        "The chat message bubbles and avatars scale appropriately on mobile (no clipped avatars, no unreadably small text).",
        "No fixed-width container (e.g., the chat history panel width) causes layout breakage on narrow screens."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only Shadcn components); compose/wrap them instead.",
    "Keep the existing Safety & Usage disclosure, Developer Safety Note, chat history, autosave, and Internet Identity login/logout behavior intact.",
    "Do not introduce new backend canisters/services; this request should be satisfied with frontend-only changes."
  ],
  "nonGoals": [
    "Adding a native mobile app (iOS/Android).",
    "Adding new chatbot capabilities or changing content/safety policy behavior.",
    "Backend schema/state migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}