{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Responsive, touch-friendly mobile chatbot UI",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Make the main chat layout responsive with a mobile toggle for the authenticated chat history panel and mobile-safe header actions.",
      "acceptanceCriteria": [
        "On small screens (e.g., 320–480px wide), the app content fits without horizontal scrolling.",
        "When authenticated, the chat history sidebar does not permanently consume screen width on mobile; it is hidden behind a toggle (e.g., drawer/sheet) or collapses, and the user can still create/select/delete chats from it.",
        "Header actions (Safety & Usage, Clear Chat when present, Sign in/out) remain reachable on mobile (wrap to multiple lines or move into an overflow menu) without overlapping/clipping.",
        "The messages list and composer remain usable on mobile: messages area scrolls independently and the composer stays accessible at the bottom without being pushed off-screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the page layout to be mobile-first: replace rigid container usage with responsive max-width + adaptive horizontal padding, enable header action wrapping/stacking on small screens, and wire an authenticated-only mobile chat-history toggle. Use shadcn-ui primitives already in the app (e.g., Dialog, Button, ScrollArea) to implement a drawer/sheet-style chat history experience on mobile while keeping the desktop sidebar on larger breakpoints. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatHistoryPanel.tsx",
          "operation": "modify",
          "description": "Make the chat history panel render correctly in both desktop sidebar and mobile drawer contexts: remove/parameterize fixed width assumptions (e.g., w-64), add responsive sizing classes, and ensure create/select/delete affordances remain available when used inside a mobile overlay. Keep existing behaviors intact and continue composing shadcn-ui components without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ResponsiveChatHistory.tsx",
          "operation": "create",
          "description": "Create a small wrapper component that renders ChatHistoryPanel as (1) a persistent sidebar on larger screens and (2) a mobile overlay (drawer/sheet pattern) behind a toggle on small screens. This component should expose props for chats/selection/new/delete and integrate with App header toggle wiring. Use shadcn-ui Dialog (or other existing overlay primitive available in the project) for the mobile overlay implementation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Improve touch ergonomics and mobile accessibility across the chat UI (composer, buttons, and dialogs).",
      "acceptanceCriteria": [
        "Primary interactive targets used frequently on mobile (send button, new chat, chat row tap area, sign in/out) meet a touch-friendly minimum size and spacing (at least ~44px tap target).",
        "Text input is comfortable on mobile: the textarea and send button do not overflow the viewport and remain visible when the on-screen keyboard is open.",
        "Dialogs (e.g., Safety & Usage, delete chat confirmation) render within the viewport on mobile with scrollable content when needed, and no content is cut off."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatComposer.tsx",
          "operation": "modify",
          "description": "Adjust the composer layout for mobile ergonomics: ensure textarea and send button remain within viewport width, increase/confirm touch target sizing (>= ~44px), and add mobile-safe behavior so the composer remains accessible near the bottom (including safe-area padding) without layout overflow. Continue composing existing shadcn-ui Textarea/Button components (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthButton.tsx",
          "operation": "modify",
          "description": "Make sign in/out touch targets mobile-friendly: increase minimum height/padding on small screens, ensure label/icon layout does not clip when header wraps, and preserve existing Internet Identity behavior. Continue using the shadcn-ui Button component via composition only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatHistoryPanel.tsx",
          "operation": "modify",
          "description": "Improve touch targets in the chat list: make each chat row a larger tap area (min height/vertical padding), ensure the delete button is reachable on touch devices (not hover-only on mobile), and constrain dialog sizing so the delete confirmation fits the viewport with scroll if needed (via shadcn-ui AlertDialog composition). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update dialog presentation for mobile: Safety & Usage dialog content should fit within the viewport with a max height and internal scrolling when needed, and header action layout should avoid overlap/clipping when wrapped. Use shadcn-ui DialogContent classes (composition only) to achieve mobile-safe sizing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Use mobile-safe sizing/spacing throughout header/main/footer and chat area widths, including message bubble/avatar scaling on small screens.",
      "acceptanceCriteria": [
        "The main chat column max width and padding adapt to small screens (reduced side padding, no forced max-width that causes cramped layout).",
        "The chat message bubbles and avatars scale appropriately on mobile (no clipped avatars, no unreadably small text).",
        "No fixed-width container (e.g., the chat history panel width) causes layout breakage on narrow screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Tune overall page sizing: adopt responsive paddings for header/main/footer, reduce side padding on small screens, and adjust the chat column max width behavior so it uses the full available width on phones while retaining a comfortable max width on desktop. Ensure no horizontal scrolling occurs at ~320px widths."
        },
        {
          "path": "frontend/src/components/ChatMessage.tsx",
          "operation": "modify",
          "description": "Adjust message row layout for small screens: ensure avatar and bubble spacing scales down gracefully, add min-width/overflow protections to prevent layout overflow, and ensure text remains readable on mobile (responsive font sizes/line heights) while keeping existing styling/role colors. Continue composing shadcn-ui Avatar primitives without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add small, global mobile-safe utilities (e.g., safe-area bottom padding helper for sticky bottom UI, optional global overflow-x prevention) using the existing Tailwind/global stylesheet entry point. Keep changes minimal and compatible with the existing theme variables."
        }
      ]
    }
  ]
}