{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Abdl Chat Bot — Safe PG-13 Chat UI (no external LLM)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a branded chat screen UI with message history, composer, send/loading, and friendly error handling.",
      "acceptanceCriteria": [
        "The app displays a chat interface with a scrollable message history and a composer to send messages.",
        "Messages are visually distinguished between user and assistant.",
        "Sending a message shows a loading indicator until a reply is returned.",
        "Any failure to get a reply shows a non-technical error message in English and keeps the user’s message visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the main app shell for “Abdl Chat Bot” and implement the core chat UI (scrollable message list with distinct user/assistant styling, text input + send button, loading indicator while awaiting a reply, and an English non-technical error banner). Wire message sending to the backend capability via the existing actor hook (useActor) calling getChatbotReply(prompt). Use shadcn-ui components (e.g., Button, Card, ScrollArea, Textarea/Input, Alert) to speed up consistent UI construction; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatMessage.tsx",
          "operation": "create",
          "description": "Add a reusable chat message row that renders user vs assistant message styling, and supports an assistant avatar slot for assistant messages. Use shadcn-ui primitives/utilities as appropriate for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatComposer.tsx",
          "operation": "create",
          "description": "Add a reusable chat composer (text input + send button) that supports disabled state during loading and triggers send on button click (and optionally Enter). Use shadcn-ui components for form controls/buttons; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a Safety & Usage disclosure and a Clear chat action that resets the current conversation without refresh.",
      "acceptanceCriteria": [
        "A clearly visible “Safety & Usage” section (or modal) is present and written in English.",
        "A “Clear chat” control removes all messages from the current chat view without requiring a page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SafetyUsage.tsx",
          "operation": "create",
          "description": "Create a visible “Safety & Usage” disclosure section (or modal content) in English stating the bot does not provide explicit sexual content and may refuse certain requests. Use shadcn-ui components (e.g., Dialog/Popover/Accordion, Alert) to present the disclosure cleanly; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the Safety & Usage disclosure into the chat screen (always visible area or a clearly labeled button that opens it) and add a prominent “Clear chat” action that resets the in-memory chat state without page refresh. Use shadcn-ui Button for the action styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure the UI includes a developer-facing warning about compromised API keys and never storing/pasting secrets; do not include the provided key anywhere.",
      "acceptanceCriteria": [
        "No code contains the provided API key string.",
        "The app includes a clear warning (in English) that the shared key must be revoked/rotated and that API keys should be stored as secrets, not in client code or chat logs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DeveloperSafetyNote.tsx",
          "operation": "create",
          "description": "Add a developer-facing note component (English) warning that any shared API key is compromised and must be revoked/rotated, and that secrets must never be pasted into chat or committed to the codebase. Do not include the actual key text anywhere. Use shadcn-ui Alert/Callout styling for visibility; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render the developer safety note in a visible place in-app (e.g., inside the Safety & Usage area or a clearly labeled “Developer Note” section) so the warning is discoverable during development. Ensure no UI or state stores/persists secrets (no localStorage/sessionStorage for chat content). Use shadcn-ui layout components if helpful; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply a consistent warm-neutral theme with teal/green accent (no blue/purple primary palette) across the chat UI for mobile and desktop.",
      "acceptanceCriteria": [
        "UI uses a consistent theme (e.g., warm neutrals with a teal/green accent, or monochrome with an accent) applied across header, chat bubbles, buttons, and background.",
        "The primary palette is not blue/purple.",
        "Layout looks intentional on mobile and desktop widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create global styles and set theme CSS variables (used by Tailwind/shadcn tokens) to a warm neutral base with a teal/green primary accent (explicitly avoid blue/purple as primary). Include sensible typography defaults and spacing for a clean chat layout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Apply the theme consistently across header, background, chat bubbles, buttons, and states (loading/error). Ensure responsive layout (mobile-first) with readable spacing and constrained content width on desktop. Use shadcn-ui components/tokens to stay consistent; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add generated static brand assets (logo + assistant avatar) and render them in the UI.",
      "acceptanceCriteria": [
        "Generated images are added under frontend/public/assets/generated.",
        "The logo is visible in the app header (or landing area).",
        "The assistant avatar is shown next to assistant messages (or in the chat header)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/abdl-chat-bot-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the provided generated logo image asset as a static file at this exact path (Minimal typographic logo reading “Abdl Chat Bot”, warm neutral background with teal accent)."
        },
        {
          "path": "frontend/public/assets/generated/abdl-chat-bot-avatar.dim_256x256.png",
          "operation": "create",
          "description": "Add the provided generated assistant avatar image asset as a static file at this exact path (Friendly simple robot head avatar icon, flat vector style, warm neutral + teal palette)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render the logo image (frontend/public/assets/generated/abdl-chat-bot-logo.dim_512x512.png) in the app header/branding area and pass the avatar image (frontend/public/assets/generated/abdl-chat-bot-avatar.dim_256x256.png) into assistant message rendering so it appears next to assistant messages. Use shadcn-ui layout components if needed; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatMessage.tsx",
          "operation": "modify",
          "description": "Update assistant message rendering to include the assistant avatar image (frontend/public/assets/generated/abdl-chat-bot-avatar.dim_256x256.png) next to assistant messages while keeping user messages distinct. Use shadcn-ui styling conventions where applicable; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}