{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Authentication UI, multi-chat history, and auto-save persistence",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add Internet Identity login/logout UI and authenticated state indicator (English) using existing InternetIdentityProvider.",
      "acceptanceCriteria": [
        "A \"Sign in\" (or equivalent) action is visible when the user is not authenticated and triggers Internet Identity login via the existing InternetIdentityProvider.",
        "A \"Sign out\" action is visible when the user is authenticated and logs the user out via the existing Internet Identity hook.",
        "The UI displays an authenticated state indicator (e.g., \"Signed in\") and does not expose any secrets or API keys.",
        "All user-facing authentication text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthButton.tsx",
          "operation": "create",
          "description": "Create a header authentication control that uses the existing immutable `useInternetIdentity` hook to trigger Internet Identity sign-in/sign-out and shows an authenticated state label. Use shadcn-ui `Button` for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupDialog.tsx",
          "operation": "create",
          "description": "Create a first-login profile setup dialog (name only) that calls backend `getCallerUserProfile`/`saveCallerUserProfile` via the actor and avoids displaying the principal id. Use shadcn-ui `Dialog`, `Input`, and `Button` components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCurrentUserProfile.ts",
          "operation": "create",
          "description": "Add a React Query hook that fetches the current user's profile from the actor (returns null when absent) and exposes loading/fetched state to prevent UI flashing during actor initialization."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire `AuthButton` into the existing header (no new routes) and display a simple authenticated indicator (e.g., \"Signed in as <name>\") sourced from `useCurrentUserProfile`. Also trigger `ProfileSetupDialog` only when authenticated and the profile is missing. Keep existing Safety & Usage and DeveloperSafetyNote UI intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Implement a ChatGPT-like conversation list UI to create, switch, and delete past chats in the current user context.",
      "acceptanceCriteria": [
        "The app shows a conversation list (tabs/sidebar/list) containing previously created chats for the current user context.",
        "The user can create a new chat and switch between chats without losing data.",
        "The user can delete a chat from history (with a basic confirmation to prevent accidental deletion).",
        "Switching chats updates the message list to the selected conversation’s messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatHistoryPanel.tsx",
          "operation": "create",
          "description": "Create a conversation list panel (sidebar/list) that renders chat summaries, supports selecting an active chat, creating a new chat, and deleting a chat with confirmation. Use shadcn-ui components such as `ScrollArea`, `Button`, and `AlertDialog` for confirmation UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useChats.ts",
          "operation": "create",
          "description": "Add React Query hooks for listing chats and fetching a selected chat when authenticated (actor `getUserChats`, `getChat`) and for creating/deleting chats (actor `createChat`, `deleteChat`). Ensure queries are keyed per-identity via existing actor behavior and can be cleared on logout by relying on QueryClient clearing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the layout to include `ChatHistoryPanel` alongside the message area, manage `selectedChatId` state, and update the rendered message list to match the selected conversation. Ensure create/switch/delete interactions update the UI without losing in-memory message edits during normal use. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Auto-save and restore chats across refresh with behavior depending on authentication state (backend persistence when signed in, local persistence when anonymous).",
      "acceptanceCriteria": [
        "When authenticated, chats are persisted to the backend and are restored after refresh and after logging back in.",
        "When not authenticated, the current chat is auto-saved locally (e.g., browser storage) and restored after refresh for the same browser.",
        "Auto-save happens automatically on send and when assistant replies are received; users do not need to click a save button.",
        "No data loss occurs when refreshing the page during normal use (excluding in-flight requests)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/chatLocalStore.ts",
          "operation": "create",
          "description": "Implement local (anonymous) chat persistence helpers using browser storage: store chat list, per-chat messages, selected chat id, and timestamps; include safe JSON parsing and versioning to avoid crashes on malformed data."
        },
        {
          "path": "frontend/src/hooks/useChatAutosave.ts",
          "operation": "create",
          "description": "Create a hook that exposes `persistOnUserSend` and `persistOnAssistantReply` behaviors. When authenticated, append messages to the selected chat via actor `addMessage` (and create a chat if needed). When anonymous, write changes through `chatLocalStore`. Also expose `restoreOnLoad` behavior to hydrate initial state from backend (authenticated) or local storage (anonymous)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate `useChatAutosave` so that: (1) on initial mount/actor readiness it restores chats and the active conversation; (2) on send it immediately updates UI and persists automatically; (3) on assistant reply it persists automatically; and (4) on logout it falls back to anonymous local persistence and clears any authenticated cached data in UI state (no secrets or API keys). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Refactor the main chat screen from single in-memory conversation to multi-chat selection + persistence, preserving Safety & Usage and DeveloperSafetyNote UI and error/loading behavior.",
      "acceptanceCriteria": [
        "The existing Safety & Usage dialog remains accessible and unchanged in meaning.",
        "The existing DeveloperSafetyNote remains visible and unchanged in meaning.",
        "The existing \"Clear Chat\" behavior is updated to clear the currently selected conversation (not all conversations) and remains visible only when there is content to clear.",
        "The app continues to show loading and error states for sending messages, and errors are displayed in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/chat.ts",
          "operation": "create",
          "description": "Define shared frontend chat types for UI state (conversation, message view model) and mapping helpers from backend `ChatView/Message` to UI message shape, without leaking principals into UI."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the single `messages` state with multi-chat state keyed by conversation id, driven by the selected conversation. Update \"Clear Chat\" to clear only the active conversation: for authenticated users, clear by deleting the active chat and immediately creating/selecting a replacement empty chat; for anonymous users, clear by removing messages for the active local chat. Keep Safety & Usage dialog and DeveloperSafetyNote placement/content unchanged, and maintain pending/loading indicator and English error messaging for send failures. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatHistoryPanel.tsx",
          "operation": "modify",
          "description": "Ensure the panel reflects selection state, disables destructive actions during in-flight operations, and surfaces basic errors in English (e.g., delete failure) without breaking the main chat UI. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}